// Задача 62: Заполните спирально массив 4 на 4 числами от 1 до 16.
Console.WriteLine("Hello, World!");
