// Задача 26: Напишите программу, которая принимает на вход число и выдает количество цифр в числе.
Console.WriteLine("Введите число");
String number = Console.ReadLine();
Console.WriteLine(number.Length);
