// Задача 6
Console.WriteLine("Введите число: ");
int number1 = Convert.ToInt32(Console.ReadLine());
if (number1 % 2 == 0)
{
  Console.WriteLine(number1+ " четное число");
}
else
{
  Console.WriteLine(number1+ " нечетное число");  
}
